app/controllers/customers_controller.rb

  def index
    @customers = Customer.all
---
SELECT `customers`.* FROM `customers`

  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save
---
INSERT INTO `customers` (`name`, `address1`, `address2`, `city`, `state`, `zip`, `phone`, `customer_type`, `rate_plan`, `created_at`, `updated_at`) VALUES ('Jeff Olen', '123 Main', 'Apt #10', 'San Clemente', 'CA', '92673', '7149257577', 'RES', 'local unlimited', '2015-07-05 22:34:46', '2015-07-05 22:34:46')

  def update
    respond_to do |format|
      if @customer.update(customer_params)
---
UPDATE `customers` SET `customer_type` = 'BUS', `updated_at` = '2015-07-05 22:35:07' WHERE `customers`.`id` = 1

  def destroy
    @customer.destroy
---
DELETE FROM `customers` WHERE `customers`.`id` = 1

    def set_customer
      @customer = Customer.find(params[:id])
---
SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1